/** <<5장: 배열>>
 * 1. 대입연산
 *   1) =: 변수선언(자료형, 자료명) 후 값 대입
 *   2) += -= *= /=: 자료에 값을 더하여(빼고 등) 대입
 *   3) %=: 값으로 나눈 나머지를 표시 
 *   
 * 2. 증감연산 (1증가 또는 1감소, ++ --)
 *   1) ++a(전위연산): 변수a에 1을 더하고 실행
 *   2) a++(후위연산): a를 실행하고 1을 더함
 *   
 *   
 *   
 * 3. 비교연산 (비교값 출력하여 true/false 표시)    +자료형 boolean 사용가능
 *   1) > >= < <=: 크고 작은지, 같거나 큰지, 같거나 작은지
 *   2) == !=: 같은지, 같지 않은지
 *   
 * 4. 논리연산 (두 식이 참인지 거짓인지 분별)
 *   1) && (and): 둘다 true일때        true
 *   2) || (or): 둘중 하나이상 true일때   true 
 *   3) ^ (xor): 둘중 하나만 true       true
 *           + &&와 & (혹은 ||와 |)의 차이: && ||는 앞 연산 틀리면 즉시 중지, & |는 틀려도 일단 끝까지 수행 (출력되는 값은 거의 비슷)
 *   
 *   
 *   
 * 5. 비트연산 (이진수연산, 결과값을 true이면 1, false이면 0으로 출력)
 * 6. 시프트연산 (이진수연산, 비트값 이동)       ex.비트값>>입력값
 *   1) << (왼쪽시프트): 비트값을 입력값만큼 왼쪽으로 이동 (뒤에 0 채움)
 *   2) >> (으론쪽시프트): 비트값을 입력값만큼 오른쪽으로 이동 (앞에 부호비트 따라 0 또는 1 채움, 양수0 음수1)
 *   3) >>>: 동일 (앞에 0 채움) =>무조건 양수화
 *   
 * 7. 삼항연산
 *   1) 조건식 ? 값1 : 값2       조건식이 참일때 값1, 거짓일때 값2 실행
 *    
 * 
 * 
 * 
 * 
 * <<6장:제어문>>
 * 
 * 1. 조건문
 *   1) if: 
 *   2) switch: 
 *   
 * 2. 반복문
 *   1) for:
 *   2) while, do while: 
 *
 */
